=========|||
empty
=========|||

======
empty
======

---

---|||

(file
  (test
    (header
      (separator)
      (name)
      (separator))
    (input)
    (separator)))

==============|||
simple
==============|||

=======
simple
=======
input
----

---|||

(file
  (test
    (header
      (separator)
      (name)
      (separator))
    (input)
    (separator)))

=============|||
attrs
=============|||

=========
attrs
:language(test)
:skip
:error
:fail-fast
:platform(linux)
=========

---

---|||

(file
  (test
    (header
      (separator)
      (name)
      (attributes
        (attribute)
        (attribute)
        (attribute)
        (attribute
          (parameter)))
      (separator))
    (input)
    (separator)))

=============|||
unknown attr
=============|||

======================
unknown attr
:unknown
:unknown_attr(value)
======================

---

---|||

(file
  (test
    (header
      (separator)
      (name)
      (separator))
    (input)
    (separator)))

============|||
empty title
============|||

============
============

---

---|||

(file
  (test
    (header
      (separator)
      (separator))
    (input)
    (separator)))

==================|||
multi line title
==================|||

======
multi
line
title
======

---

----|||

(file
  (test
    (header
      (separator)
      (name)
      (separator))
    (input)
    (separator)))
